podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/RCM_MKL82Z7.svd.xml
<!--
Devices using this peripheral: 
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "RCM_MKL82Z7" ?>
         <name>RCM</name>
         <description>Reset Control Module</description>
         <groupName>RCM</groupName>
         <prependToName>RCM_</prependToName>
         <headerStructName>RCM</headerStructName>
         <baseAddress>0x4007F000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x2</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x4</offset>
            <size>0x6</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SRS0</name>
               <description>System Reset Status Register 0</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x82</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WAKEUP</name>
                     <description>Low Leakage Wakeup Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by LLWU module wakeup source</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by LLWU module wakeup source</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LVD</name>
                     <description>Low-Voltage Detect Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by LVD trip or POR</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by LVD trip or POR</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOC</name>
                     <description>Loss-of-Clock Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by a loss of external clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by a loss of external clock</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOL</name>
                     <description>Loss-of-Lock Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by a loss of lock in the PLL</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by a loss of lock in the PLL</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDOG</name>
                     <description>Watchdog</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by watchdog timeout</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by watchdog timeout</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN</name>
                     <description>External Reset Pin</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by external reset pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by external reset pin</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POR</name>
                     <description>Power-On Reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by POR</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by POR</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRS1</name>
               <description>System Reset Status Register 1</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>LOCKUP</name>
                     <description>Core Lockup</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by core LOCKUP event</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by core LOCKUP event</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SW</name>
                     <description>Software</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by software setting of SYSRESETREQ bit</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by software setting of SYSRESETREQ bit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MDM_AP</name>
                     <description>MDM-AP System Reset Request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by host debugger system setting of the System Reset Request bit</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by host debugger system setting of the System Reset Request bit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SACKERR</name>
                     <description>Stop Mode Acknowledge Error Reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by peripheral failure to acknowledge attempt to enter stop mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by peripheral failure to acknowledge attempt to enter stop mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPFC</name>
               <description>Reset Pin Filter Control register</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RSTFLTSRW</name>
                     <description>Reset Pin Filter Select in Run and Wait Modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>All filtering disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Bus clock filter enabled for normal operation</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>LPO clock filter enabled for normal operation</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSTFLTSS</name>
                     <description>Reset Pin Filter Select in Stop Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>All filtering disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>LPO clock filter enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPFW</name>
               <description>Reset Pin Filter Width register</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RSTFLTSEL</name>
                     <description>Reset Pin Filter Bus Clock Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00000</name>
                           <description>Bus clock filter count is 1</description>
                           <value>0b00000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00001</name>
                           <description>Bus clock filter count is 2</description>
                           <value>0b00001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00010</name>
                           <description>Bus clock filter count is 3</description>
                           <value>0b00010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00011</name>
                           <description>Bus clock filter count is 4</description>
                           <value>0b00011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00100</name>
                           <description>Bus clock filter count is 5</description>
                           <value>0b00100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00101</name>
                           <description>Bus clock filter count is 6</description>
                           <value>0b00101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00110</name>
                           <description>Bus clock filter count is 7</description>
                           <value>0b00110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00111</name>
                           <description>Bus clock filter count is 8</description>
                           <value>0b00111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01000</name>
                           <description>Bus clock filter count is 9</description>
                           <value>0b01000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01001</name>
                           <description>Bus clock filter count is 10</description>
                           <value>0b01001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01010</name>
                           <description>Bus clock filter count is 11</description>
                           <value>0b01010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01011</name>
                           <description>Bus clock filter count is 12</description>
                           <value>0b01011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01100</name>
                           <description>Bus clock filter count is 13</description>
                           <value>0b01100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01101</name>
                           <description>Bus clock filter count is 14</description>
                           <value>0b01101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01110</name>
                           <description>Bus clock filter count is 15</description>
                           <value>0b01110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01111</name>
                           <description>Bus clock filter count is 16</description>
                           <value>0b01111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10000</name>
                           <description>Bus clock filter count is 17</description>
                           <value>0b10000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10001</name>
                           <description>Bus clock filter count is 18</description>
                           <value>0b10001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10010</name>
                           <description>Bus clock filter count is 19</description>
                           <value>0b10010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10011</name>
                           <description>Bus clock filter count is 20</description>
                           <value>0b10011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10100</name>
                           <description>Bus clock filter count is 21</description>
                           <value>0b10100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10101</name>
                           <description>Bus clock filter count is 22</description>
                           <value>0b10101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10110</name>
                           <description>Bus clock filter count is 23</description>
                           <value>0b10110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10111</name>
                           <description>Bus clock filter count is 24</description>
                           <value>0b10111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11000</name>
                           <description>Bus clock filter count is 25</description>
                           <value>0b11000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11001</name>
                           <description>Bus clock filter count is 26</description>
                           <value>0b11001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11010</name>
                           <description>Bus clock filter count is 27</description>
                           <value>0b11010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11011</name>
                           <description>Bus clock filter count is 28</description>
                           <value>0b11011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11100</name>
                           <description>Bus clock filter count is 29</description>
                           <value>0b11100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11101</name>
                           <description>Bus clock filter count is 30</description>
                           <value>0b11101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11110</name>
                           <description>Bus clock filter count is 31</description>
                           <value>0b11110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11111</name>
                           <description>Bus clock filter count is 32</description>
                           <value>0b11111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
